T=[-1:0.1:1];
N=[-12:25/21:12];
P = 0.5 * (N).^2-4.8*(N)+3.5;
% створення нейронної мережі
%net = newgrnn(P,T,5); %Створення узагальненої регресійної сітки
%net = newff(P,T,5); %Створення сітки прямої передачі сигналу з зворотнім поширенням помилки
%net = newrbe(P,T); %Створення радиальної базисної сітки з нульовою помилкою
%net = newlind(P,T); %Створення лінійного шару шляхом розв’язку лінійного рівняння
net.trainFcn = 'traingdx';
net=train(net,P,T);
y = sim(net,P); 
figure (1); 
hold on; 
xlabel ('T'); 
ylabel ('P'); 
plot(P,T,P,y,'o'), grid;