%задамо множину значень кластерів 
y1=0+rand(1,30);
x1=22+rand(1,30);
y2=0+rand(1,30);
x2=-22+rand(1,30);
y3=22+rand(1,30);
x3=0+rand(1,30);
x4=0+rand(1,30);
y4=-22+rand(1,30);
%виведемо всі вхідні значення на одному графіку командою figure(1) 
figure (1) 
hold on 
plot(x3,y3,'og') 
plot(x4,y4,'oy') 
plot(x1,y1,'ob') 
plot(x2,y2,'or') 
grid on 
hold off
%з'єднання всіх вхідніх даних в одну матрицю 
x(1:30)=x1; 
x(31:60)=x2; 
x(61:90)=x3; 
x(91:120)=x4; 
y(1:30)=y1; 
y(31:60)=y2; 
y(61:90)=y3; 
y(91:120)=y4; 
z(1,1:120)=x;
z(2,1:120)=y;
%задамо сітку карти Кохонена як гексогональну 2х2
net = newsom(z,[2 2]);
%проведемо цикл навчання
net = train(net, z);
a = sim(net,z);