y0=0+rand(1,30);
x0=0+rand(1,30);
y1=0+rand(1,30);
x1=22+rand(1,30);
y2=0+rand(1,30);
x2=-22+rand(1,30);
y3=22+rand(1,30);
x3=0+rand(1,30);
x4=0+rand(1,30);
y4=-22+rand(1,30);
%виведемо множину вхідних значень на графік командою figure(1)
figure(1) 
hold on
plot(x0,y0,'+k') 
plot(x1,y1,'+k') 
plot(x2,y2,'sb') 
plot(x3,y3,'r*') 
plot(x4,y4,'ok') 
grid on 
hold off
%Задамо імена цільових кластерів
T5(1:30)=5;
T1(1:30)=1; 
T2(1:30)=2; 
T3(1:30)=3; 
T4(1:30)=4;
%з'єднаємо всі назви кластерів
T(1:30)=T1; 
T(31:60)=T2; 
T(61:90)=T3; 
T(91:120)=T4;
T(121:150)=T5;
%з'єднання всієї бази знань для нейронної мережі в одну матрицю
x(1:30)=x1; 
x(31:60)=x2; 
x(61:90)=x3; 
x(91:120)=x4;
x(121:150)=x0;
y(1:30)=y1; 
y(31:60)=y2; 
y(61:90)=y3;
y(91:120)=y4;
y(121:150)=y0;
z(1,1:150)=x; 
z(2,1:150)=y;
Tc = ind2vec(T);% перетворення у вектор 
net = newlvq(z,4,[.2 .2 .2 .2 .2]); 
%навчимо створену мережу командою
net = train(net,z,Tc); 
%Перевіримо на тих спектрах, які брали участь у навчанні
a= sim (net, z);

%a = sim (net, (z+0.1))